Revit 2027 API
RebarConstraint.TargetRebarConstraintTypeIsEdge Method
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TargetRebarConstraintTypeIsEdge()
Public Function TargetRebarConstraintTypeIsEdge As Boolean
public:
bool TargetRebarConstraintTypeIsEdge()
member TargetRebarConstraintTypeIsEdge : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace